;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el
(package! org-super-agenda)
(package! find-file-in-project)
(package! lsp-mode)
(package! lsp-ui)
(package! lsp-javascript-typescript)
(package! lsp-python)
(package! lsp-java)
(package! challenger-deep-theme)
(package! company-lsp)
(package! manage-minor-mode)
(package! prettier-js)
(package! add-node-modules-path)
(package! exec-path-from-shell)
(package! lsp-treemacs)
(package! rust-mode)
(package! rustic)
(package! racer-mode)
;; Indium mode also requires npm install -g indium
;; .indium.json file in root - https://indium.readthedocs.io/en/latest/setup.html
(package! indium)
;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)
