;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el
(package! org-super-agenda)
(package! find-file-in-project)
(package! lsp-mode)
(package! lsp-ui)
(package! lsp-javascript-typescript)
(package! lsp-python)
(package! challenger-deep-theme)
(package! company-lsp)
(package! manage-minor-mode)
(package! prettier-js)
(package! add-node-modules-path)
(package! exec-path-from-shell)
;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)
